load-test/sites-template.yml
config:
  target: "https://neu-api-qa-iot.azurewebsites.net/"
  phases:
    - duration: 1
      arrivalRate: 1
  defaults:
    headers:
      Access-Control-Allow-Origin: "*"
      cache-control: "no-cache"
      Authorization: "Bearer TOKEN_PLACEHOLDER"
scenarios:
  - flow:
    - get:
        url: "/api/site/summary"
        capture:
          - json: "$"
            transform: "this.sites.map(x => x.siteId).join();"
            as: "sites"
    - log: "{{ sites }}"