load-test/sites.yml
config:
  target: "https://neu-api-qa-iot.azurewebsites.net/"
  phases:
    - duration: 1
      arrivalRate: 1
  defaults:
    headers:
      Access-Control-Allow-Origin: "*"
      cache-control: "no-cache"
      Authorization: "Bearer lBB9i61BGao0_Hl528ENidjYoGMYGL3ptA2mMhj_ZpVBquXr_OsFrnK3fAhAbqrvkl44JBwVUEoru7mTnYsWwbwnj9s7uuo8DS3lUPAZpJcHlg7zJPv5DCvS77_1m-38YHA88248uML54zhbm2M_-_m_ESOKnLwW4ytn2_9q7JJcwzu7Uy3ss_Z5nJnSIXFNeAUHmy7O5GmZgelTbmzWJl1goE81LBAX_9dndiOQuRvypsbNwaF0KTg3cWKVAtTHZdPfcCtH6XEuDO7jQkh1pHnXC5d1nCgFHk4Kn9u6QiNWa6wRjOhNkOobPii-KedPMw_8MwifTuJFOCl-EokdnXkZb4HTICZVj1up0POb1Y_oEnrcSReHigKrrRj7hyvf4UxczZjfUoSvTNHSVdsS1H6ogDugnUqWif5SUxlyg3WP6j-dNcyx9CGO43rzeSHr43yoB9fDA1WEbeOUooV2Od-blUcA5qKqroxfmrQNI4-8iu1IInSccQ8iXZ-RvYPIjkJ9ksBitZ3ndBNQTgb1kBEARAXsJSOjWstcFRjPGHY"
scenarios:
  - flow:
    - get:
        url: "/api/site/summary"
        capture:
          - json: "$"
            transform: "this.sites.map(x => x.siteId).join();"
            as: "sites"
    - log: "{{ sites }}"